tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/system/topAir/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    U
    {
        internalField   uniform ( 0.01 0 0 );
        boundaryField
        {
            minX
            {
                type            fixedValue;
                value           uniform (0.01 0 0);
            }
            maxX
            {
                type            inletOutlet;
                inletValue      uniform (0 0 0);
            }

            topAir_to_leftSolid
            {
                type            fixedValue;
                value           uniform (0 0 0);

            }
            topAir_to_heater
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
            topAir_to_rightSolid
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
        }
    }

    T
    {
        boundaryField
        {
            minX
            {
                type            fixedValue;
                value           uniform 300;
            }
            topAir_to_leftSolid
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName leftSolid;
                neighbourPatchName leftSolid_to_topAir;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 300;

            }
            topAir_to_heater
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName heater;
                neighbourPatchName heater_to_topAir;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 300;
            }
            topAir_to_rightSolid
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName rightSolid;
                neighbourPatchName rightSolid_to_topAir;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 300;
            }
        }
    }

    epsilon
    {
        // Set the value on all bc to non-zero. Not used in simulation
        // since zeroGradient; only used in initialisation.
        boundaryField
        {
            minX
            {
                type            fixedValue;
                value           uniform 0.01;
            }
            maxX
            {
                type            zeroGradient;
                value           uniform 0.01;
            }

            minY
            {
                type            zeroGradient;
                value           uniform 0.01;
            }
            maxY
            {
                type            zeroGradient;
                value           uniform 0.01;
            }

            minZ
            {
                type            zeroGradient;
                value           uniform 0.01;
            }
            maxZ
            {
                type            zeroGradient;
                value           uniform 0.01;
            }
            topAir_to_leftSolid
            {
                type            zeroGradient;
                value           uniform 0.01;
            }
            topAir_to_heater
            {
                type            zeroGradient;
                value           uniform 0.01;
            }
            topAir_to_rightSolid
            {
                type            zeroGradient;
                value           uniform 0.01;
            }
        }
    }

    k
    {
        internalField   uniform 0.1;
        boundaryField
        {
            minX
            {
                type            fixedValue;
                value           uniform 0.1;
            }

            maxX
            {
                type            zeroGradient;
                value           uniform 0.1;
            }

            minY
            {
                type            zeroGradient;
                value           uniform 0.1;
            }
            maxY
            {
                type            zeroGradient;
                value           uniform 0.1;
            }

            minZ
            {
                type            zeroGradient;
                value           uniform 0.1;
            }
            maxZ
            {
                type            zeroGradient;
                value           uniform 0.1;
            }

            topAir_to_leftSolid
            {
                type            zeroGradient;
                value           uniform 0.1;
            }
            topAir_to_heater
            {
                type            zeroGradient;
                value           uniform 0.1;
            }
            topAir_to_rightSolid
            {
                type            zeroGradient;
                value           uniform 0.1;
            }
        }
    }

    p
    {
        boundaryField
        {
            minX
            {
                type            buoyantPressure;
                value           uniform 1e+05;
            }
            maxX
            {
                type            waveTransmissive;
                field           pd;
                U               U;
                phi             phi;
                rho             rho;
                psi             psi;
                gamma           1.4;    // cp/cv
                fieldInf        0;
                lInf            0.40;   // double length of domain
                inletOutlet     off;
                correctSupercritical off;
                value           uniform 1e+05;
            }

            minY
            {
                type            buoyantPressure;
                value           uniform 1e+05;
            }

            minZ
            {
                type            buoyantPressure;
                value           uniform 1e+05;
            }
            maxZ
            {
                type            buoyantPressure;
                value           uniform 1e+05;
            }

            topAir_to_leftSolid
            {
                type            buoyantPressure;
                value           uniform 1e+05;
            }
            topAir_to_heater
            {
                type            buoyantPressure;
                value           uniform 1e+05;
            }
            topAir_to_rightSolid
            {
                type            buoyantPressure;
                value           uniform 1e+05;
            }
        }
    }

}


// ************************************************************************* //
